/*
649. Dota2 参议院
已解答
中等
相关标签
premium lock icon
相关企业
Dota2 的世界里有两个阵营：Radiant（天辉）和 Dire（夜魇）

Dota2 参议院由来自两派的参议员组成。现在参议院希望对一个 Dota2 游戏里的改变作出决定。他们以一个基于轮为过程的投票进行。在每一轮中，每一位参议员都可以行使两项权利中的 一 项：

剥夺一名参议员的权利：一名参议员可以使另一名参议员在本轮及所有后续轮次中失去所有权利。
宣布胜利：如果参议员发现有权利投票的参议员都是 同一个阵营的 ，他可以宣布胜利并决定在游戏中的有关变化。
给你一个字符串 senate 代表每个参议员的阵营。字母 'R' 和 'D'分别代表了 Radiant（天辉）和 Dire（夜魇）。然后，如果有 n 个参议员，给定字符串的大小将是 n。

以轮为基础的过程从给定顺序的第一个参议员开始到最后一个参议员结束。这一过程将持续到投票结束。所有失去权利的参议员将在过程中被跳过。

假设每一位参议员都足够聪明，会为自己的政党做出最好的策略，你需要预测哪一方最终会宣布胜利并在 Dota2 游戏中决定改变。输出应该是 "Radiant" 或 "Dire" 。

 

示例 1：

输入：senate = "RD"
输出："Radiant"
解释：
第 1 轮时，第一个参议员来自 Radiant 阵营，他可以使用第一项权利让第二个参议员失去所有权利。
这一轮中，第二个参议员将会被跳过，因为他的权利被禁止了。
第 2 轮时，第一个参议员可以宣布胜利，因为他是唯一一个有投票权的人。
示例 2：

输入：senate = "RDD"
输出："Dire"
解释：
第 1 轮时，第一个来自 Radiant 阵营的参议员可以使用第一项权利禁止第二个参议员的权利。
这一轮中，第二个来自 Dire 阵营的参议员会将被跳过，因为他的权利被禁止了。
这一轮中，第三个来自 Dire 阵营的参议员可以使用他的第一项权利禁止第一个参议员的权利。
因此在第二轮只剩下第三个参议员拥有投票的权利,于是他可以宣布胜利
 

提示：

n == senate.length
1 <= n <= 104
senate[i] 为 'R' 或 'D'
*/

#include<bits/stdc++.h>
using namespace std;

class Solution {
public:
    string predictPartyVictory(string senate) {          //这道题的思路是采用贪心和循环队列
    //对题目所用到的知识点的分析：1、因为题目说参议员是按顺序进行投票的，所以可以想到队列（按顺序，所以想到队列）；2、因为投票有多轮，所以采用循环队列
        int len=senate.size();
        queue<int>q_R,q_D;
        //这边的队列存储的是每个字母对应的下标，方便用于比较哪个字母的顺序更靠前
        //遍历字符串，记录下标
        for(int i=0;i<len;i++){
            if(senate[i]=='D'){
                q_D.push(i);
            }
            else{
                q_R.push(i);
            }
        }
        while(!q_D.empty()&&!q_R.empty()){           //这里面这个循环的处理是重点
            if(q_R.front()<q_D.front()){             //如果当前R字符的下标在D之前，采用贪心算法，先将对手否决掉
            //这边让front的数据加上len，可以让当前的参议员进入到下一轮的投票中，这个是重点！！！！！！！
                q_R.push(q_R.front()+len);           //否决完之后，当前的参议员要进入到下一轮的投票，无法继续在本轮继续行使投票权利
            }
            else{
                q_D.push(q_D.front()+len);           //同理
            }
            q_R.pop();                               //将当前的字符处理之后，都要将他们出队，让被否决的参议员出局，行使权力的参议员进入到下一轮的投票活动中，防止重复行使权力
            q_D.pop();
        }
        if(q_D.empty())return "Radiant";             //最后哪个队列先为空，那么说明该队已经被全部否决，说明该队失败，返回另一队的名字
        return "Dire";                               //同理
    }
};